ams/src/Documents/_УстановкаСтоимостиРабот/_УстановкаСтоимостиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_УстановкаСтоимостиРабот</name>
  <registerRecords>InformationRegister._ЦеныФасовкиПродукции</registerRecords>
  <registerRecords>InformationRegister._ЦеныРабот</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef._Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/InformationRegisters/_ЦеныФасовкиПродукции/_ЦеныФасовкиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_ЦеныФасовкиПродукции</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Documents/_УстановкаСтоимостиРабот/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЦехПриИзменении(Элемент)
	НастройкаФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		ПоказатьПредупреждение( , "Не заполнено поле ""Склад"".");
	КонецЕсли;

	Если Объект.Товары.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Таблица товаров будет очищена. Продолжить выполнение операции?",
			РежимДиалогаВопрос.ДаНет);

	Иначе
		ЗаполнитьТовары();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеДокумента(Команда)
	СсылкаНаОбъект = Объект.Ссылка;
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ПараметрКоманды", СсылкаНаОбъект);

		ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", ПараметрыФормы, ЭтотОбъект, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьТовары();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Сегмент", мср.СоответствиеСегментНоменклатурыОтЦеха().Получить(Объект.Склад));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК т
	|ГДЕ
	|	т.Сегмент = &Сегмент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныФасовки.Номенклатура КАК Номенклатура,
	|	ЦеныФасовки.Цена КАК Цена
	|ПОМЕСТИТЬ ц
	|ИЗ
	|	РегистрСведений._ЦеныФасовкиПродукции.СрезПоследних(&Дата, ) КАК ЦеныФасовки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ц.Цена, 100) КАК Цена
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ц КАК ц
	|		ПО тов.Номенклатура = ц.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	тов.Номенклатура.Наименование";

	Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура НастройкаФормы()
	Элементы.СтраницаТовары.Видимость = Не (Объект.Склад = AMS_ВызовСервера.СкладПродукции());
КонецПроцедуры

#КонецОбласти
